python_pytorch.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-04-20 Tue 00:57 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Python - Pytorch</title>
<meta name="generator" content="Org mode">
<meta name="author" content="shaka">
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Python - Pytorch</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd79d47d">张量</a></li>
<li><a href="#orgee97e64">神经网络</a>
<ul>
<li><a href="#org393490d">正向传播与反向传播</a></li>
<li><a href="#org6c9644c">典型训练过程</a></li>
<li><a href="#org8e8d72f">定义网络</a></li>
</ul>
</li>
<li><a href="#org973cbad">数据集</a></li>
<li><a href="#org7845546">数据加载器</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd79d47d" class="outline-2">
<h2 id="orgd79d47d">张量</h2>
<div class="outline-text-2" id="text-orgd79d47d">
<p>
在pytorch中，神经网络的输入、输出、以及网络的参数等都采用了“张量”的数据结构。张量与numpy中的多维数组(<code>numpy.ndarray</code>)非常类似，区别在于张量可以在GPU或其他硬件上运行。
</p>
</div>
</div>
<div id="outline-container-orgee97e64" class="outline-2">
<h2 id="orgee97e64">神经网络</h2>
<div class="outline-text-2" id="text-orgee97e64">
</div>
<div id="outline-container-org393490d" class="outline-3">
<h3 id="org393490d">正向传播与反向传播</h3>
<div class="outline-text-3" id="text-org393490d">
<p>
神经网络的训练包括两个步骤
</p>
<dl class="org-dl">
<dt>正向传播</dt><dd>神经网络根据输入对输出进行最佳预测。</dd>
<dt>反向传播</dt><dd>神经网络根据预测误差调整其参数。</dd>
</dl>

<p>
当调用误差张量的成员函数 <code>.backward()</code> 时，开始反向传播，整个网络将被微分。Pytorch的自动差分引擎 <code>torch.autograd</code> 会对计算每个属性 <code>requires_grad=True</code> 的网络参数的梯度并将其累积在该网络参数的 <code>.grad</code> 属性中。所以，在反向传播开始之前，需要清空神经网络各个参数和反向传播的梯度缓冲区。
</p>

<p>
然后，需要从 <code>torch.optim</code> 中加载一个优化器(如随机梯度下降，SGD)。通过调用该优化器的 <code>.step()</code> 方法启动梯度下降，优化器会根据每个网络参数的梯度(存储于其 <code>.grad</code> 属性中)来对其进行调整。
</p>
</div>
</div>
<div id="outline-container-org6c9644c" class="outline-3">
<h3 id="org6c9644c">典型训练过程</h3>
<div class="outline-text-3" id="text-org6c9644c">
<ul class="org-ul">
<li>构建含有一些可学习参数(或权重)的神经网络。</li>
<li>遍历训练数据集。</li>
<li>让输入通过网络得到输出。</li>
<li>计算预测误差(或损失函数)。</li>
<li>通过反向传播，计算并存储网络各个参数的梯度。</li>
<li>根据各个参数的梯度对其进行调整，如 <code>weight = weight - learning_rate x gradient</code> 。</li>
</ul>
</div>
</div>
<div id="outline-container-org8e8d72f" class="outline-3">
<h3 id="org8e8d72f">定义网络</h3>
<div class="outline-text-3" id="text-org8e8d72f">
<p>
可以使用 <code>torch.nn</code> 包来构建神经网络。
</p>
<ul class="org-ul">
<li>基类 <code>torch.nn.Module</code> 包含
<ul class="org-ul">
<li>网络的各个层(作为类属性)，如输入层、输出层、隐藏层等。</li>
<li>成员函数 <code>.forward</code> 。</li>
<li>成员函数 <code>.zero_grad</code> ，用于清空神经网络中所有参数的梯度缓冲区。</li>
</ul></li>
<li>构建神经网络可以通过定义以 <code>torch.nn.Module</code> 为基类的派生类完成。</li>
<li>只需要在派生类中重载成员函数 <code>.forward</code> ， <code>torch.autograd</code> 就会自动为网络各个参数定义 <code>.backward()</code> 函数。</li>
<li>所构建的神经网络的可学习参数由所述派生类的成员函数 <code>.parameters()</code> 返回。</li>
<li><code>torch.nn</code> 包中定义了很多损失函数(如 <code>torch.nn.MSELoss</code>)。</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org973cbad" class="outline-2">
<h2 id="org973cbad">数据集</h2>
<div class="outline-text-2" id="text-org973cbad">
<p>
自定义的数据集可以通过定义以(<code>torch.utils.data.Dataset</code>)为基类的派生类完成。具体地，需要重载如下三个函数：
</p>
<ul class="org-ul">
<li><code>__init__(self)</code>: 载入数据；</li>
<li><code>__getitem__(self, index)</code>: 根据索引返回数据集中相应的样本点；</li>
<li><code>__len(self)__</code>: 返回数据集的大小，也即数据集中样本点的数量。</li>
</ul>
</div>
</div>
<div id="outline-container-org7845546" class="outline-2">
<h2 id="org7845546">数据加载器</h2>
<div class="outline-text-2" id="text-org7845546">
<p>
基于自定义的数据集，可以使用类 <code>torch.utils.data.DataLoader</code> 来生成相应的数据加载器。如
</p>
<div class="org-src-container">
<pre class="src src-python">from torch.utils.data import Dataset, DataLoader
dataloader = DataLoader(dataset=My_Dataset, batch_size=BATCH_SIZE, shuffle=SHUFFLE, num_workers=NUM_WORKERS)
</pre>
</div>
<p>
其中，
</p>
<ul class="org-ul">
<li><code>My_Dataset</code> 为自定义的数据集；</li>
<li><code>BATCH_SIZE</code> 为每个batch中含有的样本点个数；</li>
<li><code>SHUFFLE</code> 为布尔型变量，用于指定数据集是否会被随机打乱顺序；</li>
<li><code>NUM_WORKERS</code> 为用于数据加载的线程个数。</li>
</ul>
</div>
</div>
</div>
</body>
</html>
